//***************************************************************************
//***************************************************************************
//**                                                                       **
//**       (C)Copyright 1993-2017 Supermicro Computer, Inc.                **
//**                                                                       **
//***************************************************************************
//***************************************************************************
//  File History
//
//  Rev. 1.02   For SmcOptimize Module.
//    Bug Fix:
//    Reason:   
//    Auditor:  Leon Xu
//    Date:     Jul/21/2017
//
//  Rev. 1.01   Correct setup item "Workload Configuration" setting.
//    Bug Fix:
//    Reason:   Reference spec, MSR 0xA01 Bit[2:0] value should be 0:Balanced, 2:I/O sensitive.
//    Auditor:  Jimmy Chiu
//    Date:     Jul/19/2017
//
//  Rev. 1.00   Add setup item "Maximum Performance" for always turbo mode function.
//    Bug Fix:
//    Reason:   Reference from Grantlley, control by TOKEN "MAX_PERFORMANCE_OPTION", default disabled.
//    Auditor:  Jimmy Chiu (Refer Grantley)
//
//***************************************************************************
//
// This file contains an 'Intel Peripheral Driver' and is      
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may 
// be modified by the user, subject to additional terms of the 
// license agreement                                           
//
// *++
//
// Copyright (c) 1999 - 2017 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//
//
// Module Name:
//
//   PowerManagmentSetupStrings.uni
//
// Abstract:
//
//   String definitions for Power Management Setup formset.
//
// Revision History:
//
// --*/

/=#

#langdef   en-US "English"

//
// Advanced - Power Management Configuration
//
// TBD - Have to move this to PowerManagement.uni

#string STR_POWER_MGT_CONFIG_FORM_TITLE #language en-US "Advanced Power Management Configuration"
#string STR_POWER_MGT_CONFIG_FORM_HELP  #language en-US "Displays and provides option to change the Power Management Settings"

#string STR_ENABLE_JMP_FOR_PEGA                 #language en-US "Enable JMP $"
#string STR_ENABLE_JMP_FOR_PEGA_HELP            #language en-US "Enable Jump $ on any REV of BIOS for various Power Management enabling through PEGA"

#string STR_MAXPSTATE                           #language en-US "Maximum p-state"
#string STR_MAXCLIP                             #language en-US "Max clip "
#string STR_THRESHOLD                           #language en-US "Threshold "
#string STR_AVGPSTATE                           #language en-US "Average P-State "

#string STR_PPCCCLOCK_1                         #language en-US "Lock Indication"
#string STR_PPCCCLOCK_HELP                      #language en-US "When set locks various PM registers"
#string STR_SAPMCTL_LOCK_S0                     #language en-US "SAPMCTL_CFG LOCK"
#string STR_SAPMCTL_LOCK_S1                     #language en-US "SAPMCTL_CFG LOCK"
#string STR_SAPMCTL_LOCK_S2                     #language en-US "SAPMCTL_CFG LOCK"
#string STR_SAPMCTL_LOCK_S3                     #language en-US "SAPMCTL_CFG LOCK"
#string STR_SAPMCTL_LOCK_S4                     #language en-US "SAPMCTL_CFG LOCK"
#string STR_SAPMCTL_LOCK_S5                     #language en-US "SAPMCTL_CFG LOCK"
#string STR_SAPMCTL_LOCK_S6                     #language en-US "SAPMCTL_CFG LOCK"
#string STR_SAPMCTL_LOCK_S7                     #language en-US "SAPMCTL_CFG LOCK"
#string STR_SAPMCTL_LOCK_HELP                   #language en-US "When set locks various PM registers"
#string STR_SETVID_DECAY_DISABLE                #language en-US "SetVID Decay Disable"
#string STR_SETVID_DECAY_DISABLE_S0                #language en-US "SetVID Decay Disable"
#string STR_SETVID_DECAY_DISABLE_S1                #language en-US "SetVID Decay Disable"
#string STR_SETVID_DECAY_DISABLE_S2                #language en-US "SetVID Decay Disable"
#string STR_SETVID_DECAY_DISABLE_S3                #language en-US "SetVID Decay Disable"
#string STR_SETVID_DECAY_DISABLE_S4                #language en-US "SetVID Decay Disable"
#string STR_SETVID_DECAY_DISABLE_S5                #language en-US "SetVID Decay Disable"
#string STR_SETVID_DECAY_DISABLE_S6                #language en-US "SetVID Decay Disable"
#string STR_SETVID_DECAY_DISABLE_S7                #language en-US "SetVID Decay Disable"
#string STR_SETVID_DECAY_DISABLE_HELP           #language en-US "Used by BIOS to disable SETVID Decay to enable use of VR12. NOTE: Socket 0 setting will be applied for all sockets."
#string STR_KTI_L0S_PLL_SEN_ENABLE              #language en-US "UPI_L0S_PLL_SEN_ENABLE"
#string STR_KTI_L0S_PLL_SEN_ENABLE_HELP         #language en-US "Used by BIOS to disable UPI L0S link state from playing any role in TurnPLL"
#string STR_KTI_L0_PLL_SEN_ENABLE               #language en-US "UPI_L0_PLL_SEN_ENABLE"
#string STR_KTI_L0_PLL_SEN_ENABLE_HELP          #language en-US "Used by BIOS to disable UPI L0 link state from playing any role in TurnPLL"
#string STR_IIO_L0S_PLL_SEN_ENABLE              #language en-US "IIO_L0S_PLL_SEN_ENABLE"
#string STR_IIO_L0S_PLL_SEN_ENABLE_HELP         #language en-US "Used by BIOS to disable IIO L0S link state from playing any role in TurnPLL"
#string STR_IIO_L0_PLL_SEN_ENABLE               #language en-US "IIO_L0_PLL_SEN_ENABLE"
#string STR_IIO_L0_PLL_SEN_ENABLE_HELP          #language en-US "Used by BIOS to disable IIO L0 link state from playing any role in TurnPLL "
#string STR_MC1_PKGC                          #language en-US "MC1 PKGC CLK GATE DISABLE"
#string STR_MC1_PKGC_S0                          #language en-US "MC1 PKGC CLK GATE DISABLE"
#string STR_MC1_PKGC_S1                          #language en-US "MC1 PKGC CLK GATE DISABLE"
#string STR_MC1_PKGC_S2                          #language en-US "MC1 PKGC CLK GATE DISABLE"
#string STR_MC1_PKGC_S3                          #language en-US "MC1 PKGC CLK GATE DISABLE"
#string STR_MC1_PKGC_S4                          #language en-US "MC1 PKGC CLK GATE DISABLE"
#string STR_MC1_PKGC_S5                          #language en-US "MC1 PKGC CLK GATE DISABLE"
#string STR_MC1_PKGC_S6                          #language en-US "MC1 PKGC CLK GATE DISABLE"
#string STR_MC1_PKGC_S7                          #language en-US "MC1 PKGC CLK GATE DISABLE"
#string STR_MC1_PKGC_HELP                     #language en-US "MC1 PKGC CLK GATE is Disabled when in PKG-C6 state"
#string STR_MC0_PKGC                          #language en-US "MC0 PKGC CLK GATE DISABLE"
#string STR_MC0_PKGC_S0                          #language en-US "MC0 PKGC CLK GATE DISABLE"
#string STR_MC0_PKGC_S1                          #language en-US "MC0 PKGC CLK GATE DISABLE"
#string STR_MC0_PKGC_S2                          #language en-US "MC0 PKGC CLK GATE DISABLE"
#string STR_MC0_PKGC_S3                          #language en-US "MC0 PKGC CLK GATE DISABLE"
#string STR_MC0_PKGC_S4                          #language en-US "MC0 PKGC CLK GATE DISABLE"
#string STR_MC0_PKGC_S5                          #language en-US "MC0 PKGC CLK GATE DISABLE"
#string STR_MC0_PKGC_S6                          #language en-US "MC0 PKGC CLK GATE DISABLE"
#string STR_MC0_PKGC_S7                          #language en-US "MC0 PKGC CLK GATE DISABLE"
#string STR_MC0_PKGC_HELP                     #language en-US "MC0 PKGC CLK GATE is Disabled in PKG-C6 state"
#string STR_SACG_MPLL                           #language en-US "Ungate SA Clock PLL"
#string STR_SACG_MPLL_HELP                      #language en-US "Ungate System Agent Clock When Memory PLL is On"
#string STR_NSWAKE_SREXIT                       #language en-US "Non-Snoop Wakeup"
#string STR_NSWAKE_SREXIT_HELP                  #language en-US "Non-Snoop Wakeup Triggers Self Refresh Exit"
#string STR_SACG_SREXIT                         #language en-US "Ungate SA Clock SR"
#string STR_SACG_SREXIT_HELP                    #language en-US "Ungate System Agent Clock on Self Refresh Exit"
#string STR_MDLL_OFF_SEN                        #language en-US "Memory DLL Shutdown"
#string STR_MDLL_OFF_SEN_HELP                   #language en-US "Memory DLL Shutdown Sensitivity"
#string STR_MPLL_OFF_SEN                        #language en-US "Memory PLL Shutdown"
#string STR_MPLL_OFF_SEN_HELP                   #language en-US "Memory PLL Shutdown Sensitivity"
#string STR_SACG_SEN                            #language en-US "SA Clock Gating"
#string STR_SACG_SEN_HELP                       #language en-US "System Agent Clock Gating Sensitivity"
#string STR_KTI01_PLL_OFF_ENA_S0                     #language en-US "UPI01 PLL Shutdown En"
#string STR_KTI01_PLL_OFF_ENA_S1                     #language en-US "UPI01 PLL Shutdown En"
#string STR_KTI01_PLL_OFF_ENA_S2                     #language en-US "UPI01 PLL Shutdown En"
#string STR_KTI01_PLL_OFF_ENA_S3                     #language en-US "UPI01 PLL Shutdown En"
#string STR_KTI01_PLL_OFF_ENA_S4                     #language en-US "UPI01 PLL Shutdown En"
#string STR_KTI01_PLL_OFF_ENA_S5                     #language en-US "UPI01 PLL Shutdown En"
#string STR_KTI01_PLL_OFF_ENA_S6                     #language en-US "UPI01 PLL Shutdown En"
#string STR_KTI01_PLL_OFF_ENA_S7                     #language en-US "UPI01 PLL Shutdown En"
#string STR_KTI01_PLL_OFF_ENA_HELP                   #language en-US "UPI01 PLL Shutdown Enable"
#string STR_KTI23_PLL_OFF_ENA_S0                     #language en-US "UPI23 PLL Shutdown En"
#string STR_KTI23_PLL_OFF_ENA_S1                     #language en-US "UPI23 PLL Shutdown En"
#string STR_KTI23_PLL_OFF_ENA_S2                     #language en-US "UPI23 PLL Shutdown En"
#string STR_KTI23_PLL_OFF_ENA_S3                     #language en-US "UPI23 PLL Shutdown En"
#string STR_KTI23_PLL_OFF_ENA_S4                     #language en-US "UPI23 PLL Shutdown En"
#string STR_KTI23_PLL_OFF_ENA_S5                     #language en-US "UPI23 PLL Shutdown En"
#string STR_KTI23_PLL_OFF_ENA_S6                     #language en-US "UPI23 PLL Shutdown En"
#string STR_KTI23_PLL_OFF_ENA_S7                     #language en-US "UPI23 PLL Shutdown En"
#string STR_KTI23_PLL_OFF_ENA_HELP                   #language en-US "UPI23 PLL Shutdown Enable"
#string STR_KPLL_OFF_ENA                        #language en-US "UPI PLL Shutdown En"
#string STR_KPLL_OFF_ENA_HELP                   #language en-US "UPI PLL Shutdown Enable"
#string STR_PPLL_OFF_ENA                        #language en-US "PCIe PLL Shutdown En"
#string STR_PPLL_OFF_ENA_HELP                   #language en-US "PCIe PLL Shutdown Enable"
#string STR_P0PLL_OFF_ENA_S0                     #language en-US "PCIe IIO0 PLL Shutdown En"
#string STR_P0PLL_OFF_ENA_S1                     #language en-US "PCIe IIO0 PLL Shutdown En"
#string STR_P0PLL_OFF_ENA_S2                     #language en-US "PCIe IIO0 PLL Shutdown En"
#string STR_P0PLL_OFF_ENA_S3                     #language en-US "PCIe IIO0 PLL Shutdown En"
#string STR_P0PLL_OFF_ENA_S4                     #language en-US "PCIe IIO0 PLL Shutdown En"
#string STR_P0PLL_OFF_ENA_S5                     #language en-US "PCIe IIO0 PLL Shutdown En"
#string STR_P0PLL_OFF_ENA_S6                     #language en-US "PCIe IIO0 PLL Shutdown En"
#string STR_P0PLL_OFF_ENA_S7                     #language en-US "PCIe IIO0 PLL Shutdown En"
#string STR_P1PLL_OFF_ENA_S0                     #language en-US "PCIe IIO1 PLL Shutdown En"
#string STR_P1PLL_OFF_ENA_S1                     #language en-US "PCIe IIO1 PLL Shutdown En"
#string STR_P1PLL_OFF_ENA_S2                     #language en-US "PCIe IIO1 PLL Shutdown En"
#string STR_P1PLL_OFF_ENA_S3                     #language en-US "PCIe IIO1 PLL Shutdown En"
#string STR_P1PLL_OFF_ENA_S4                     #language en-US "PCIe IIO1 PLL Shutdown En"
#string STR_P1PLL_OFF_ENA_S5                     #language en-US "PCIe IIO1 PLL Shutdown En"
#string STR_P1PLL_OFF_ENA_S6                     #language en-US "PCIe IIO1 PLL Shutdown En"
#string STR_P1PLL_OFF_ENA_S7                     #language en-US "PCIe IIO1 PLL Shutdown En"
#string STR_P2PLL_OFF_ENA_S0                     #language en-US "PCIe IIO2 PLL Shutdown En"
#string STR_P2PLL_OFF_ENA_S1                     #language en-US "PCIe IIO2 PLL Shutdown En"
#string STR_P2PLL_OFF_ENA_S2                     #language en-US "PCIe IIO2 PLL Shutdown En"
#string STR_P2PLL_OFF_ENA_S3                     #language en-US "PCIe IIO2 PLL Shutdown En"
#string STR_P2PLL_OFF_ENA_S4                     #language en-US "PCIe IIO2 PLL Shutdown En"
#string STR_P2PLL_OFF_ENA_S5                     #language en-US "PCIe IIO2 PLL Shutdown En"
#string STR_P2PLL_OFF_ENA_S6                     #language en-US "PCIe IIO2 PLL Shutdown En"
#string STR_P2PLL_OFF_ENA_S7                     #language en-US "PCIe IIO2 PLL Shutdown En"
#string STR_MPLL_OFF_ENA                        #language en-US "Mem PLLs Shutdown En"
#string STR_MPLL_OFF_ENA_HELP                   #language en-US "Memory PLLs Shutdown Enable"
#string STR_MC0PLL_OFF_ENA_S0                     #language en-US "MC0 PLLs Shutdown En"
#string STR_MC0PLL_OFF_ENA_S1                     #language en-US "MC0 PLLs Shutdown En"
#string STR_MC0PLL_OFF_ENA_S2                     #language en-US "MC0 PLLs Shutdown En"
#string STR_MC0PLL_OFF_ENA_S3                     #language en-US "MC0 PLLs Shutdown En"
#string STR_MC0PLL_OFF_ENA_S4                     #language en-US "MC0 PLLs Shutdown En"
#string STR_MC0PLL_OFF_ENA_S5                     #language en-US "MC0 PLLs Shutdown En"
#string STR_MC0PLL_OFF_ENA_S6                     #language en-US "MC0 PLLs Shutdown En"
#string STR_MC0PLL_OFF_ENA_S7                     #language en-US "MC0 PLLs Shutdown En"
#string STR_MC1PLL_OFF_ENA_S0                     #language en-US "MC1 PLLs Shutdown En"
#string STR_MC1PLL_OFF_ENA_S1                     #language en-US "MC1 PLLs Shutdown En"
#string STR_MC1PLL_OFF_ENA_S2                     #language en-US "MC1 PLLs Shutdown En"
#string STR_MC1PLL_OFF_ENA_S3                     #language en-US "MC1 PLLs Shutdown En"
#string STR_MC1PLL_OFF_ENA_S4                     #language en-US "MC1 PLLs Shutdown En"
#string STR_MC1PLL_OFF_ENA_S5                     #language en-US "MC1 PLLs Shutdown En"
#string STR_MC1PLL_OFF_ENA_S6                     #language en-US "MC1 PLLs Shutdown En"
#string STR_MC1PLL_OFF_ENA_S7                     #language en-US "MC1 PLLs Shutdown En"
#string STR_SACG_ENA                            #language en-US "SA Clock Gating En"
#string STR_SACG_ENA_HELP                       #language en-US "System Agent Clock Gating Enable"

#string STR_KTI_INPKGCENTRY                   #language en-US "UPI in PkgCEntry"
#string STR_KTI_INPKGCENTRY_HELP              #language en-US "Global setting for UPI in PkgCEntry"
#string STR_PCIE_INPKGCENTRY                 #language en-US "PCIE in PkgCEntry"
#string STR_PCIE_INPKGCENTRY_HELP            #language en-US "Global setting for PCIE in PkgCEntry"

#string STR_IN_L0S                            #language en-US "IN_L0S"
#string STR_IN_L1                             #language en-US "IN_L1"
#string STR_L0S_L1                            #language en-US "L0s & L1"
#string STR_KTI_0_IN_S0                       #language en-US "UPI_0_IN_L1"
#string STR_KTI_0_IN_S1                       #language en-US "UPI_0_IN_L1"
#string STR_KTI_0_IN_S2                       #language en-US "UPI_0_IN_L1"
#string STR_KTI_0_IN_S3                       #language en-US "UPI_0_IN_L1"
#string STR_KTI_0_IN_S4                       #language en-US "UPI_0_IN_L1"
#string STR_KTI_0_IN_S5                       #language en-US "UPI_0_IN_L1"
#string STR_KTI_0_IN_S6                       #language en-US "UPI_0_IN_L1"
#string STR_KTI_0_IN_S7                       #language en-US "UPI_0_IN_L1"
#string STR_KTI_0_IN_HELP                     #language en-US "UPI_0 is selected either Disable or IN_L1"
#string STR_KTI_1_IN_S0                       #language en-US "UPI_1_IN_L1"
#string STR_KTI_1_IN_S1                       #language en-US "UPI_1_IN_L1"
#string STR_KTI_1_IN_S2                       #language en-US "UPI_1_IN_L1"
#string STR_KTI_1_IN_S3                       #language en-US "UPI_1_IN_L1"
#string STR_KTI_1_IN_S4                       #language en-US "UPI_1_IN_L1"
#string STR_KTI_1_IN_S5                       #language en-US "UPI_1_IN_L1"
#string STR_KTI_1_IN_S6                       #language en-US "UPI_1_IN_L1"
#string STR_KTI_1_IN_S7                       #language en-US "UPI_1_IN_L1"
#string STR_KTI_1_IN_HELP                     #language en-US "UPI_1 is selected either Disable or IN_L1"
#string STR_KTI_2_IN_S0                       #language en-US "UPI_2_IN_L1"
#string STR_KTI_2_IN_S1                       #language en-US "UPI_2_IN_L1"
#string STR_KTI_2_IN_S2                       #language en-US "UPI_2_IN_L1"
#string STR_KTI_2_IN_S3                       #language en-US "UPI_2_IN_L1"
#string STR_KTI_2_IN_S4                       #language en-US "UPI_2_IN_L1"
#string STR_KTI_2_IN_S5                       #language en-US "UPI_2_IN_L1"
#string STR_KTI_2_IN_S6                       #language en-US "UPI_2_IN_L1"
#string STR_KTI_2_IN_S7                       #language en-US "UPI_2_IN_L1"
#string STR_KTI_2_IN_HELP                     #language en-US "UPI_2 is selected either Disable or IN_L1"

#string STR_PCIE0_IN_LX_S0                    #language en-US "PCIE Port0 PCIE_IN"
#string STR_PCIE1_IN_LX_S0                    #language en-US "PCIE Port1 PCIE_IN"
#string STR_PCIE2_IN_LX_S0                    #language en-US "PCIE Port2 PCIE_IN"
#string STR_PCIE3_IN_LX_S0                    #language en-US "PCIE Port3 PCIE_IN"
#string STR_PCIE4_IN_LX_S0                    #language en-US "PCIE Port4 PCIE_IN"
#string STR_PCIE5_IN_LX_S0                    #language en-US "PCIE Port5 PCIE_IN"
#string STR_PCIE6_IN_LX_S0                    #language en-US "PCIE Port6 PCIE_IN"
#string STR_PCIE7_IN_LX_S0                    #language en-US "PCIE Port7 PCIE_IN"
#string STR_PCIE8_IN_LX_S0                    #language en-US "PCIE Port8 PCIE_IN"
#string STR_PCIE9_IN_LX_S0                    #language en-US "PCIE Port9 PCIE_IN"
#string STR_PCIE10_IN_LX_S0                   #language en-US "PCIE Port10 PCIE_IN"
#string STR_PCIE11_IN_LX_S0                   #language en-US "PCIE Port11 PCIE_IN"
#string STR_PCIE12_IN_LX_S0                   #language en-US "PCIE Port12 PCIE_IN"
#string STR_PCIE13_IN_LX_S0                   #language en-US "PCIE Port13 PCIE_IN"
#string STR_PCIE14_IN_LX_S0                   #language en-US "PCIE Port14 PCIE_IN"
#string STR_PCIE15_IN_LX_S0                   #language en-US "PCIE Port15 PCIE_IN"
#string STR_PCIE16_IN_LX_S0                   #language en-US "PCIE Port16 PCIE_IN"
#string STR_PCIE17_IN_LX_S0                   #language en-US "PCIE Port17 PCIE_IN"
#string STR_PCIE18_IN_LX_S0                   #language en-US "PCIE Port18 PCIE_IN"
#string STR_PCIE19_IN_LX_S0                   #language en-US "PCIE Port19 PCIE_IN"
#string STR_PCIE20_IN_LX_S0                   #language en-US "PCIE Port20 PCIE_IN"
#string STR_PCIE21_IN_LX_S0                   #language en-US "PCIE Port21 PCIE_IN"
#string STR_PCIE22_IN_LX_S0                   #language en-US "PCIE Port22 PCIE_IN"
#string STR_PCIE23_IN_LX_S0                   #language en-US "PCIE Port23 PCIE_IN"

#string STR_PCIE0_IN_LX_S1                    #language en-US "PCIE Port0 PCIE_IN"
#string STR_PCIE1_IN_LX_S1                    #language en-US "PCIE Port1 PCIE_IN"
#string STR_PCIE2_IN_LX_S1                    #language en-US "PCIE Port2 PCIE_IN"
#string STR_PCIE3_IN_LX_S1                    #language en-US "PCIE Port3 PCIE_IN"
#string STR_PCIE4_IN_LX_S1                    #language en-US "PCIE Port4 PCIE_IN"
#string STR_PCIE5_IN_LX_S1                    #language en-US "PCIE Port5 PCIE_IN"
#string STR_PCIE6_IN_LX_S1                    #language en-US "PCIE Port6 PCIE_IN"
#string STR_PCIE7_IN_LX_S1                    #language en-US "PCIE Port7 PCIE_IN"
#string STR_PCIE8_IN_LX_S1                    #language en-US "PCIE Port8 PCIE_IN"
#string STR_PCIE9_IN_LX_S1                    #language en-US "PCIE Port9 PCIE_IN"
#string STR_PCIE10_IN_LX_S1                   #language en-US "PCIE Port10 PCIE_IN"
#string STR_PCIE11_IN_LX_S1                   #language en-US "PCIE Port11 PCIE_IN"
#string STR_PCIE12_IN_LX_S1                   #language en-US "PCIE Port12 PCIE_IN"
#string STR_PCIE13_IN_LX_S1                   #language en-US "PCIE Port13 PCIE_IN"
#string STR_PCIE14_IN_LX_S1                   #language en-US "PCIE Port14 PCIE_IN"
#string STR_PCIE15_IN_LX_S1                   #language en-US "PCIE Port15 PCIE_IN"
#string STR_PCIE16_IN_LX_S1                   #language en-US "PCIE Port16 PCIE_IN"
#string STR_PCIE17_IN_LX_S1                   #language en-US "PCIE Port17 PCIE_IN"
#string STR_PCIE18_IN_LX_S1                   #language en-US "PCIE Port18 PCIE_IN"
#string STR_PCIE19_IN_LX_S1                   #language en-US "PCIE Port19 PCIE_IN"
#string STR_PCIE20_IN_LX_S1                   #language en-US "PCIE Port20 PCIE_IN"
#string STR_PCIE21_IN_LX_S1                   #language en-US "PCIE Port21 PCIE_IN"
#string STR_PCIE22_IN_LX_S1                   #language en-US "PCIE Port22 PCIE_IN"
#string STR_PCIE23_IN_LX_S1                   #language en-US "PCIE Port23 PCIE_IN"

#string STR_PCIE0_IN_LX_S2                    #language en-US "PCIE Port0 PCIE_IN"
#string STR_PCIE1_IN_LX_S2                    #language en-US "PCIE Port1 PCIE_IN"
#string STR_PCIE2_IN_LX_S2                    #language en-US "PCIE Port2 PCIE_IN"
#string STR_PCIE3_IN_LX_S2                    #language en-US "PCIE Port3 PCIE_IN"
#string STR_PCIE4_IN_LX_S2                    #language en-US "PCIE Port4 PCIE_IN"
#string STR_PCIE5_IN_LX_S2                    #language en-US "PCIE Port5 PCIE_IN"
#string STR_PCIE6_IN_LX_S2                    #language en-US "PCIE Port6 PCIE_IN"
#string STR_PCIE7_IN_LX_S2                    #language en-US "PCIE Port7 PCIE_IN"
#string STR_PCIE8_IN_LX_S2                    #language en-US "PCIE Port8 PCIE_IN"
#string STR_PCIE9_IN_LX_S2                    #language en-US "PCIE Port9 PCIE_IN"
#string STR_PCIE10_IN_LX_S2                   #language en-US "PCIE Port10 PCIE_IN"
#string STR_PCIE11_IN_LX_S2                   #language en-US "PCIE Port11 PCIE_IN"
#string STR_PCIE12_IN_LX_S2                   #language en-US "PCIE Port12 PCIE_IN"
#string STR_PCIE13_IN_LX_S2                   #language en-US "PCIE Port13 PCIE_IN"
#string STR_PCIE14_IN_LX_S2                   #language en-US "PCIE Port14 PCIE_IN"
#string STR_PCIE15_IN_LX_S2                   #language en-US "PCIE Port15 PCIE_IN"
#string STR_PCIE16_IN_LX_S2                   #language en-US "PCIE Port16 PCIE_IN"
#string STR_PCIE17_IN_LX_S2                   #language en-US "PCIE Port17 PCIE_IN"
#string STR_PCIE18_IN_LX_S2                   #language en-US "PCIE Port18 PCIE_IN"
#string STR_PCIE19_IN_LX_S2                   #language en-US "PCIE Port19 PCIE_IN"
#string STR_PCIE20_IN_LX_S2                   #language en-US "PCIE Port20 PCIE_IN"
#string STR_PCIE21_IN_LX_S2                   #language en-US "PCIE Port21 PCIE_IN"
#string STR_PCIE22_IN_LX_S2                   #language en-US "PCIE Port22 PCIE_IN"
#string STR_PCIE23_IN_LX_S2                   #language en-US "PCIE Port23 PCIE_IN"

#string STR_PCIE0_IN_LX_S3                    #language en-US "PCIE Port0 PCIE_IN"
#string STR_PCIE1_IN_LX_S3                    #language en-US "PCIE Port1 PCIE_IN"
#string STR_PCIE2_IN_LX_S3                    #language en-US "PCIE Port2 PCIE_IN"
#string STR_PCIE3_IN_LX_S3                    #language en-US "PCIE Port3 PCIE_IN"
#string STR_PCIE4_IN_LX_S3                    #language en-US "PCIE Port4 PCIE_IN"
#string STR_PCIE5_IN_LX_S3                    #language en-US "PCIE Port5 PCIE_IN"
#string STR_PCIE6_IN_LX_S3                    #language en-US "PCIE Port6 PCIE_IN"
#string STR_PCIE7_IN_LX_S3                    #language en-US "PCIE Port7 PCIE_IN"
#string STR_PCIE8_IN_LX_S3                    #language en-US "PCIE Port8 PCIE_IN"
#string STR_PCIE9_IN_LX_S3                    #language en-US "PCIE Port9 PCIE_IN"
#string STR_PCIE10_IN_LX_S3                   #language en-US "PCIE Port10 PCIE_IN"
#string STR_PCIE11_IN_LX_S3                   #language en-US "PCIE Port11 PCIE_IN"
#string STR_PCIE12_IN_LX_S3                   #language en-US "PCIE Port12 PCIE_IN"
#string STR_PCIE13_IN_LX_S3                   #language en-US "PCIE Port13 PCIE_IN"
#string STR_PCIE14_IN_LX_S3                   #language en-US "PCIE Port14 PCIE_IN"
#string STR_PCIE15_IN_LX_S3                   #language en-US "PCIE Port15 PCIE_IN"
#string STR_PCIE16_IN_LX_S3                   #language en-US "PCIE Port16 PCIE_IN"
#string STR_PCIE17_IN_LX_S3                   #language en-US "PCIE Port17 PCIE_IN"
#string STR_PCIE18_IN_LX_S3                   #language en-US "PCIE Port18 PCIE_IN"
#string STR_PCIE19_IN_LX_S3                   #language en-US "PCIE Port19 PCIE_IN"
#string STR_PCIE20_IN_LX_S3                   #language en-US "PCIE Port20 PCIE_IN"
#string STR_PCIE21_IN_LX_S3                   #language en-US "PCIE Port21 PCIE_IN"
#string STR_PCIE22_IN_LX_S3                   #language en-US "PCIE Port22 PCIE_IN"
#string STR_PCIE23_IN_LX_S3                   #language en-US "PCIE Port23 PCIE_IN"

#string STR_PCIE0_IN_LX_S4                    #language en-US "PCIE Port0 PCIE_IN"
#string STR_PCIE1_IN_LX_S4                    #language en-US "PCIE Port1 PCIE_IN"
#string STR_PCIE2_IN_LX_S4                    #language en-US "PCIE Port2 PCIE_IN"
#string STR_PCIE3_IN_LX_S4                    #language en-US "PCIE Port3 PCIE_IN"
#string STR_PCIE4_IN_LX_S4                    #language en-US "PCIE Port4 PCIE_IN"
#string STR_PCIE5_IN_LX_S4                    #language en-US "PCIE Port5 PCIE_IN"
#string STR_PCIE6_IN_LX_S4                    #language en-US "PCIE Port6 PCIE_IN"
#string STR_PCIE7_IN_LX_S4                    #language en-US "PCIE Port7 PCIE_IN"
#string STR_PCIE8_IN_LX_S4                    #language en-US "PCIE Port8 PCIE_IN"
#string STR_PCIE9_IN_LX_S4                    #language en-US "PCIE Port9 PCIE_IN"
#string STR_PCIE10_IN_LX_S4                   #language en-US "PCIE Port10 PCIE_IN"
#string STR_PCIE11_IN_LX_S4                    #language en-US "PCIE Port11 PCIE_IN"
#string STR_PCIE12_IN_LX_S4                    #language en-US "PCIE Port12 PCIE_IN"
#string STR_PCIE13_IN_LX_S4                    #language en-US "PCIE Port13 PCIE_IN"
#string STR_PCIE14_IN_LX_S4                   #language en-US "PCIE Port14 PCIE_IN"

#string STR_PCIE0_IN_LX_S5                    #language en-US "PCIE Port0 PCIE_IN"
#string STR_PCIE1_IN_LX_S5                    #language en-US "PCIE Port1 PCIE_IN"
#string STR_PCIE2_IN_LX_S5                    #language en-US "PCIE Port2 PCIE_IN"
#string STR_PCIE3_IN_LX_S5                    #language en-US "PCIE Port3 PCIE_IN"
#string STR_PCIE4_IN_LX_S5                    #language en-US "PCIE Port4 PCIE_IN"
#string STR_PCIE5_IN_LX_S5                    #language en-US "PCIE Port5 PCIE_IN"
#string STR_PCIE6_IN_LX_S5                    #language en-US "PCIE Port6 PCIE_IN"
#string STR_PCIE7_IN_LX_S5                    #language en-US "PCIE Port7 PCIE_IN"
#string STR_PCIE8_IN_LX_S5                    #language en-US "PCIE Port8 PCIE_IN"
#string STR_PCIE9_IN_LX_S5                    #language en-US "PCIE Port9 PCIE_IN"
#string STR_PCIE10_IN_LX_S5                   #language en-US "PCIE Port10 PCIE_IN"
#string STR_PCIE11_IN_LX_S5                    #language en-US "PCIE Port11 PCIE_IN"
#string STR_PCIE12_IN_LX_S5                    #language en-US "PCIE Port12 PCIE_IN"
#string STR_PCIE13_IN_LX_S5                    #language en-US "PCIE Port13 PCIE_IN"
#string STR_PCIE14_IN_LX_S5                   #language en-US "PCIE Port14 PCIE_IN"

#string STR_PCIE0_IN_LX_S6                   #language en-US "PCIE Port0 PCIE_IN"
#string STR_PCIE1_IN_LX_S6                    #language en-US "PCIE Port1 PCIE_IN"
#string STR_PCIE2_IN_LX_S6                    #language en-US "PCIE Port2 PCIE_IN"
#string STR_PCIE3_IN_LX_S6                    #language en-US "PCIE Port3 PCIE_IN"
#string STR_PCIE4_IN_LX_S6                    #language en-US "PCIE Port4 PCIE_IN"
#string STR_PCIE5_IN_LX_S6                    #language en-US "PCIE Port5 PCIE_IN"
#string STR_PCIE6_IN_LX_S6                    #language en-US "PCIE Port6 PCIE_IN"
#string STR_PCIE7_IN_LX_S6                    #language en-US "PCIE Port7 PCIE_IN"
#string STR_PCIE8_IN_LX_S6                    #language en-US "PCIE Port8 PCIE_IN"
#string STR_PCIE9_IN_LX_S6                    #language en-US "PCIE Port9 PCIE_IN"
#string STR_PCIE10_IN_LX_S6                   #language en-US "PCIE Port10 PCIE_IN"
#string STR_PCIE11_IN_LX_S6                    #language en-US "PCIE Port11 PCIE_IN"
#string STR_PCIE12_IN_LX_S6                    #language en-US "PCIE Port12 PCIE_IN"
#string STR_PCIE13_IN_LX_S6                    #language en-US "PCIE Port13 PCIE_IN"
#string STR_PCIE14_IN_LX_S6                   #language en-US "PCIE Port14 PCIE_IN"

#string STR_PCIE0_IN_LX_S7                    #language en-US "PCIE Port0 PCIE_IN"
#string STR_PCIE1_IN_LX_S7                    #language en-US "PCIE Port1 PCIE_IN"
#string STR_PCIE2_IN_LX_S7                    #language en-US "PCIE Port2 PCIE_IN"
#string STR_PCIE3_IN_LX_S7                    #language en-US "PCIE Port3 PCIE_IN"
#string STR_PCIE4_IN_LX_S7                    #language en-US "PCIE Port4 PCIE_IN"
#string STR_PCIE5_IN_LX_S7                    #language en-US "PCIE Port5 PCIE_IN"
#string STR_PCIE6_IN_LX_S7                    #language en-US "PCIE Port6 PCIE_IN"
#string STR_PCIE7_IN_LX_S7                    #language en-US "PCIE Port7 PCIE_IN"
#string STR_PCIE8_IN_LX_S7                    #language en-US "PCIE Port8 PCIE_IN"
#string STR_PCIE9_IN_LX_S7                    #language en-US "PCIE Port9 PCIE_IN"
#string STR_PCIE10_IN_LX_S7                   #language en-US "PCIE Port10 PCIE_IN"
#string STR_PCIE11_IN_LX_S7                    #language en-US "PCIE Port11 PCIE_IN"
#string STR_PCIE12_IN_LX_S7                    #language en-US "PCIE Port12 PCIE_IN"
#string STR_PCIE13_IN_LX_S7                    #language en-US "PCIE Port13 PCIE_IN"
#string STR_PCIE14_IN_LX_S7                   #language en-US "PCIE Port14 PCIE_IN"


#string STR_PCIE_IN_HELP                      #language en-US "If IN_L1, set PCIE port in L1."

#string STR_SOCKET_CPUPWRADVPMCFG_0_FORM    #language en-US "CPU0 Advanced PM Tuning"
#string STR_SOCKET_CPUPWRADVPMCFG_1_FORM    #language en-US "CPU1 Advanced PM Tuning"
#string STR_SOCKET_CPUPWRADVPMCFG_2_FORM    #language en-US "CPU2 Advanced PM Tuning"
#string STR_SOCKET_CPUPWRADVPMCFG_3_FORM    #language en-US "CPU3 Advanced PM Tuning"
#string STR_SOCKET_CPUPWRADVPMCFG_4_FORM    #language en-US "CPU4 Advanced PM Tuning"
#string STR_SOCKET_CPUPWRADVPMCFG_5_FORM    #language en-US "CPU5 Advanced PM Tuning"
#string STR_SOCKET_CPUPWRADVPMCFG_6_FORM    #language en-US "CPU6 Advanced PM Tuning"
#string STR_SOCKET_CPUPWRADVPMCFG_7_FORM    #language en-US "CPU7 Advanced PM Tuning"
#string STR_SOCKET_CPUPWRADVPMCFG_HELP      #language en-US "Socket Specific Advanced PM Tuning"

#string STR_PKGCENTRYOVRD_VALCTL                #language en-US "PKGC_ENTRY_CRITERIA OVRD"
#string STR_PKGCENTRYOVRD_VALCTL_HELP           #language en-US "Allows manual overrides for PKG_CST_ENTRY_CRITERIA_MASK"

#string STR_SOCKET_PKGCENTRY_0_FORM    #language en-US "CPU0 PgkC ENTRY CRITERIA"
#string STR_SOCKET_PKGCENTRY_1_FORM    #language en-US "CPU1 PgkC ENTRY CRITERIA"
#string STR_SOCKET_PKGCENTRY_2_FORM    #language en-US "CPU2 PgkC ENTRY CRITERIA"
#string STR_SOCKET_PKGCENTRY_3_FORM    #language en-US "CPU3 PgkC ENTRY CRITERIA"
#string STR_SOCKET_PKGCENTRY_4_FORM    #language en-US "CPU4 PgkC ENTRY CRITERIA"
#string STR_SOCKET_PKGCENTRY_5_FORM    #language en-US "CPU5 PgkC ENTRY CRITERIA"
#string STR_SOCKET_PKGCENTRY_6_FORM    #language en-US "CPU6 PgkC ENTRY CRITERIA"
#string STR_SOCKET_PKGCENTRY_7_FORM    #language en-US "CPU7 PgkC ENTRY CRITERIA"
#string STR_SOCKET_PKGCENTRY_HELP      #language en-US "Socket Specific PgkC ENTRY CRITERIA"

#string STR_SOCKET_PKGCSAPM_0_FORM    #language en-US "CPU0 SAPMCTL_CFG "
#string STR_SOCKET_PKGCSAPM_1_FORM    #language en-US "CPU1 SAPMCTL_CFG"
#string STR_SOCKET_PKGCSAPM_2_FORM    #language en-US "CPU2 SAPMCTL_CFG"
#string STR_SOCKET_PKGCSAPM_3_FORM    #language en-US "CPU3 SAPMCTL_CFG"
#string STR_SOCKET_PKGCSAPM_4_FORM    #language en-US "CPU4 SAPMCTL_CFG"
#string STR_SOCKET_PKGCSAPM_5_FORM    #language en-US "CPU5 SAPMCTL_CFG"
#string STR_SOCKET_PKGCSAPM_6_FORM    #language en-US "CPU6 SAPMCTL_CFG"
#string STR_SOCKET_PKGCSAPM_7_FORM    #language en-US "CPU7 SAPMCTL_CFG"
#string STR_SOCKET_PKGCSAPM_HELP      #language en-US "Socket Specific SAPMCTL_CFG"

#string STR_LOT26_ENABLE_PROMPT                 #language en-US "LOT26 Enable"
#string STR_LOT26_ENABLE_HELP                   #language en-US "For HEDT *only*, select whether VR power is turned off to empty DIMM channels."
#string STR_PPCCCOVRD_VALCTL                    #language en-US "PP0 Current_Cfg_Ctl Override"
#string STR_PPCCCOVRD_VALCTL_HELP               #language en-US "Allows manual overrides for Primary_Plane_Current_Config_Control"
#string STR_CURRENT_CONFIG                      #language en-US "Current Limit Override"
#string STR_CURRENT_CONFIG_HELP                 #language en-US "0 - Default, do nothing;  1 - Manual, override Current limitation in 1/8 A increments."

#string STR_DYNNAMIC_L1                       #language en-US "Dynamic L1"
#string STR_DYNNAMIC_L1_HELP                  #language en-US "PCU_MISC_CONFIG Bit[21] = dynamic L1 enable"
#string STR_PKG_C_LAT_NEG                     #language en-US "PKG C-state Lat. Neg."
#string STR_PKG_C_LAT_NEG_HELP                #language en-US "MSR 1FCh Bit[30] = PCH_NEG_DISABLE"
#string STR_LTR_IIO_INPUT                      #language en-US "LTR IIO Input"
#string STR_LTR_IIO_INPUT_HELP                 #language en-US "MSR 1FCh Bit[29] = LTR_IIO_DISABLE. Disable = Ignore IIO LTR input."
#string STR_TAKE_IIO_LTR                       #language en-US "Take IIO LTR input."
#string STR_IGNORE_IIO_LTR                     #language en-US "Ignore IIO LTR input."
#string STR_PWR_PERF_TUNING                   #language en-US "Power Performance Tuning"
#string STR_PWR_PERF_TUNING_HELP              #language en-US "MSR 1FCh Bit[25] = PWR_PERF_TUNING_CFG_MODE. Enable - Use IA32_ENERGY_PERF_BIAS input from the core;\nDisable - Use alternate perf BIAS input from ENERGY_PERF_BIAS_CONFIG"
#string STR_PWR_PERF_OS_EPB                   #language en-US "OS Controls EPB"
#string STR_PWR_PERF_BIOS_EPB                 #language en-US "BIOS Controls EPB"
#string STR_PWR_PERF_SWITCH                   #language en-US "Dynamic Loadline Switch"
#string STR_PWR_PERF_SWITCH_HELP              #language en-US "Dynamic Loadline Switch control. MSR 0x1FC[Bit24]"
#string STR_PWR_ENERGY_PERF                   #language en-US "ENERGY_PERF_BIAS_CFG mode"
#string STR_PWR_ENERGY_PERF_HELP              #language en-US "Use input from ENERGY_PERF_BIAS_CONFIG mode selection. PERF/Balanced Perf/Balanced Power/Power"
#string STR_ENERGY_PERF_MODE_1                #language en-US "Performance"
#string STR_ENERGY_PERF_MODE_2                #language en-US "Balanced Performance"
#string STR_ENERGY_PERF_MODE_3                #language en-US "Balanced Power"
#string STR_ENERGY_PERF_MODE_4                #language en-US "Power"
#string STR_ENERGY_PERF_MODE_5                #language en-US "Maximum Performance"
#string STR_SAPM_CTRL                         #language en-US "SAPM Control"
#string STR_SAPM_CTRL_HELP                    #language en-US "MSR 1FCh Bit[22] = PWR_PERF_TUNING_DISABLE_SAPM_CTRL"

#string STR_PSI3_CODE                           #language en-US "PSI3 Code"
#string STR_PSI3_CODE_HELP                      #language en-US "PSI3 Code"
#string STR_PSI3_THSHOLD                        #language en-US "PSI3 Threshold"
#string STR_PSI3_THSHOLD_HELP                   #language en-US "PSI3 Threshold"
#string STR_PSI2_CODE                           #language en-US "PSI2 Code"
#string STR_PSI2_CODE_HELP                      #language en-US "SI2 Code"
#string STR_PSI2_THSHOLD                        #language en-US "PSI2 Threshold"
#string STR_PSI2_THSHOLD_HELP                   #language en-US "PSI2 Threshold"
#string STR_PSI1_CODE                           #language en-US "PSI1 Code"
#string STR_PSI1_CODE_HELP                      #language en-US "PSI1 Code"
#string STR_PSI1_THSHOLD                        #language en-US "PSI1 Threshold"
#string STR_PSI1_THSHOLD_HELP                   #language en-US "PSI1 Threshold"
#string STR_PPCCCLOCK                           #language en-US "Lock Indication"
#string STR_PPCCCLOCK_HELP                      #language en-US "Lock for CURRENT_LIMIT settings\nMove this into the Config Above"
#string STR_CURRENT_LIMIT                       #language en-US "Current Limitation"
#string STR_CURRENT_LIMIT_HELP                  #language en-US "Current limitation in 1/8 A increments. This field is locked by VR_CURRENT_CONFIG[LOCK]\nValue <= CURRENT_LIMIT"

#string STR_TURBO_MODE_ENABLE                   #language en-US "Turbo Mode"
#string STR_TURBO_MODE_ENABLE_HELP              #language en-US "Enable/Disable processor Turbo Mode (requires EMTTM enabled too)."

#string STR_TURBO_PWR_LIMIT_LOCK                #language en-US "Package RAPL Limit MSR Lock"
#string STR_TURBO_PWR_LIMIT_LOCK_HELP           #language en-US "Enable/Disable locking of Package RAPL Limit MSR and a reset will be required to unlock the register."

#string STR_TURBO_PWR_LIMIT_CSR_LOCK            #language en-US "Package RAPL Limit CSR Lock"
#string STR_TURBO_PWR_LIMIT_CSR_LOCK_HELP       #language en-US "Enable/Disable locking of Package RAPL Limit CSR and a reset will be required to unlock the register."

#string STR_LONG_DUR_PWR_LIMIT_OVERRIDE         #language en-US "PL1 Limit"
#string STR_LONG_DUR_PWR_LIMIT_OVERRIDE_HELP    #language en-US "Enable/Disable PL1. If this option is disabled, BIOS will program the deafult values for PL1 Power Limit and PL1 Time Window."

#string STR_LONG_DUR_PWR_LIMIT                  #language en-US "PL1 Power Limit"
#string STR_LONG_DUR_PWR_LIMIT_HELP             #language en-US "PL1 Power Limit in Watts. The value may vary from 0 to Fused Value. If the value is 0, the fused value will be programmed. A value greater than fused TDP value will not be programmed."

#string STR_LONG_DUR_TIME_WINDOW                #language en-US "PL1 Time Window"
#string STR_LONG_DUR_TIME_WINDOW_HELP           #language en-US "PL1 value in seconds. The value may vary from 0 to 56. Indicates the time window over which TDP value should be maintained. If the value is 0, the fused value will be programmed."

#string STR_PKG_CLMP_LIM_1                      #language en-US "Pkg Clmp Lim1"
#string STR_PKG_CLMP_LIM_1_HELP                 #language en-US "Pkg Clamping limit 1, Allow going below P1. 0: PBBM limited between P1 and P0, 1: PBM can go below P1"

#string STR_PKG_CLMP_LIM_2                      #language en-US "Pkg Clmp Lim2"
#string STR_PKG_CLMP_LIM_2_HELP                 #language en-US "Pkg Clamping limit 2, Allow going below P1. 0: PBBM limited between P1 and P0, 1: PBM can go below P1"

#string STR_SHORT_DUR_TIME_WINDOW               #language en-US "PL2 Time Window"
#string STR_SHORT_DUR_TIME_WINDOW_HELP          #language en-US "PL2 value in seconds. The value may vary from 0 to 56. Indicates the time window over which TDP value should be maintained. If the value is 0, the fused value will be programmed."

#string STR_LIMITP1_P0                          #language en-US "Bewtee P1/P0"
#string STR_LIMIT_BELOW_P1                      #language en-US "Below P1"

#string STR_SHORT_DUR_PWR_LIMIT_1               #language en-US "PL2 Limit"
#string STR_SHORT_DUR_PWR_LIMIT_1_ENABLE_HELP   #language en-US "Enable/Disable PL2. If this option is disabled, BIOS will program the deafult values for PL2 Power Limit and PL2 Time Window."
#string STR_SHORT_DUR_PWR_LIMIT                 #language en-US "PL2 Power Limit"
#string STR_SHORT_DUR_PWR_LIMIT_HELP            #language en-US "PL2 Power Limit in Watts. The value may vary from 0 to Fused Value. If the value is 0, BIOS programs 125% * TDP"
PL2 Time Window
#string STR_EEP_L_OVERRIDE                      #language en-US "EEP_L_OVERRIDE"
#string STR_EEP_L_OVERRIDE_HELP                 #language en-US "This indicates a EEP L override. Value 0-15"
#string STR_EEP_L_OVERRIDE_ENABLE               #language en-US "EEP_L_OVERRIDE_ENABLE"
#string STR_EEP_L_OVERRIDE_ENABLE_HELP          #language en-US "EEP_L override"
#string STR_I_TURBO_OVERRIDE_ENABLE             #language en-US "I_TURBO_OVERRIDE_ENABLE"
#string STR_I_TURBO_OVERRIDE_ENABLE_HELP        #language en-US "I_TURBO Override"
#string STR_CST_DEMOTION_OVERRIDE_ENABLE        #language en-US "CST_DEMOTION_OVRD_ENABLE"
#string STR_CST_DEMOTION_OVERRIDE_ENABLE_HELP   #language en-US "CST_DEMOTION Override"
#string STR_TURBO_DEMOTION_OVERRIDE_ENABLE      #language en-US "TURBO_DEMOTION_OVRD_ENABLE"
#string STR_TURBO_DEMOTION_OVERRIDE_ENABLE_HELP #language en-US "Turbo Demotion Override"
#string STR_UNCORE_PERF_PLIMIT_OVRD_EN          #language en-US "UNCORE_PERF_PLIMIT_OVRD_EN"
#string STR_UNCORE_PERF_PLIMIT_OVRD_EN_HELP     #language en-US "Uncore Perf PLimit Override"
#string STR_EET_OVERRIDE_ENABLE                 #language en-US "EET_OVERRIDE_ENABLE"
#string STR_EET_OVERRIDE_ENABLE_HELP            #language en-US "EET override"
#string STR_IO_BW_PLIMIT_OVRD_EN                #language en-US "IO_BW_PLIMIT_OVRD_EN"
#string STR_IO_BW_PLIMIT_OVRD_EN_HELP           #language en-US "IO BW PLimit Override"
#string STR_IMC_APM_OVERRIDE_ENABLE             #language en-US "IMC_APM_OVERRIDE_ENABLE"
#string STR_IMC_APM_OVERRIDE_ENABLE_HELP        #language en-US "IMC APM Override"
#string STR_IOM_APM_OVERRIDE_ENABLE             #language en-US "IOM_APM_OVERRIDE_ENABLE"
#string STR_IOM_APM_OVERRIDE_ENABLE_HELP        #language en-US "IOM APM Override"
#string STR_KTI_APM_OVERRIDE_ENABLE             #language en-US "UPI_APM_OVERRIDE_ENABLE"
#string STR_KTI_APM_OVERRIDE_ENABLE_HELP        #language en-US "UPI APM Override"

#string STR_SNOOP_LATVALID_PROMPT           #language en-US "Snoop Latency Override"
#string STR_SNOOP_LATVALID_PROMPT_HELP      #language en-US "Snoop Latency override Control"
#string STR_SNOOP_LATOVRD_PROMPT            #language en-US "Force Snoop Latency Override"
#string STR_SNOOP_LATOVRD_PROMPT_HELP       #language en-US "Control to ignore PCIe LTR, and force the Snoop Latency value"
#string STR_SNOOP_LATMULT_PROMPT            #language en-US "Snoop Latency Multiplier"
#string STR_SNOOP_LATMULT_PROMPT_HELP       #language en-US "Override Value is multiplied by this field to yield a time value"
#string STR_SNOOP_LATVAL_PROMPT             #language en-US "Force Non-Snoop Latency Override"
#string STR_SNOOP_LATVAL_PROMPT_HELP        #language en-US "Control to ignore PCIe LTR, and force the Non-Snoop Latency value"
#string STR_NONSNOOP_LATVALID_PROMPT        #language en-US "Non-Snoop Latency Override"
#string STR_NONSNOOP_LATVALID_PROMPT_HELP   #language en-US "Non-Snoop Latency override Control"
#string STR_NONSNOOP_LATOVRD_PROMPT         #language en-US "Non-Snoop Latency Override"
#string STR_NONSNOOP_LATOVRD_PROMPT_HELP    #language en-US "Force PCODe to always use values provided in SW_LTR_OVRD"
#string STR_NONSNOOP_LATMULT_PROMPT         #language en-US "Non-Snoop Latency Multiplier"
#string STR_NONSNOOP_LATMULT_PROMPT_HELP    #language en-US "Override Value is multiplied by this field to yield a time value"
#string STR_NONSNOOP_LATVAL_PROMPT          #language en-US "Non-Snoop Latency Value"
#string STR_NONSNOOP_LATVAL_PROMPT_HELP     #language en-US "Latency requirement for Non-Snoop requests"

#string STR_CPU_XE_PROMPT                       #language en-US "  Extreme Edition"
#string STR_CPU_XE_HELP                         #language en-US "Enable/Disable Extreme Edition support."

#string STR_OVERCLOCKING_LOCK                   #language en-US "  Overclocking Lock"
#string STR_OVERCLOCKING_LOCK_HELP              #language en-US "Enable/Disable Overclocking."

#string STR_XE_RATIO_LIMIT_FORM_TITLE           #language en-US "Overclocking"
#string STR_XE_RATIO_LIMIT_FORM_HELP            #language en-US "Provide manual XE Ratio Limit setting"

#string STR_IIO0_PKGC_CLOCK_GATE_DISABLE               #language en-US "IIO0_PKGC_CLK_GATE_DISABLE"
#string STR_IIO0_PKGC_CLOCK_GATE_DISABLE_S0               #language en-US "IIO0_PKGC_CLK_GATE_DISABLE"
#string STR_IIO0_PKGC_CLOCK_GATE_DISABLE_S1               #language en-US "IIO0_PKGC_CLK_GATE_DISABLE"
#string STR_IIO0_PKGC_CLOCK_GATE_DISABLE_S2               #language en-US "IIO0_PKGC_CLK_GATE_DISABLE"
#string STR_IIO0_PKGC_CLOCK_GATE_DISABLE_S3               #language en-US "IIO0_PKGC_CLK_GATE_DISABLE"
#string STR_IIO0_PKGC_CLOCK_GATE_DISABLE_S4               #language en-US "IIO0_PKGC_CLK_GATE_DISABLE"
#string STR_IIO0_PKGC_CLOCK_GATE_DISABLE_S5               #language en-US "IIO0_PKGC_CLK_GATE_DISABLE"
#string STR_IIO0_PKGC_CLOCK_GATE_DISABLE_S6               #language en-US "IIO0_PKGC_CLK_GATE_DISABLE"
#string STR_IIO0_PKGC_CLOCK_GATE_DISABLE_S7               #language en-US "IIO0_PKGC_CLK_GATE_DISABLE"
#string STR_IIO1_PKGC_CLOCK_GATE_DISABLE               #language en-US "IIO1_PKGC_CLK_GATE_DISABLE"
#string STR_IIO1_PKGC_CLOCK_GATE_DISABLE_S0               #language en-US "IIO1_PKGC_CLK_GATE_DISABLE"
#string STR_IIO1_PKGC_CLOCK_GATE_DISABLE_S1               #language en-US "IIO1_PKGC_CLK_GATE_DISABLE"
#string STR_IIO1_PKGC_CLOCK_GATE_DISABLE_S2               #language en-US "IIO1_PKGC_CLK_GATE_DISABLE"
#string STR_IIO1_PKGC_CLOCK_GATE_DISABLE_S3               #language en-US "IIO1_PKGC_CLK_GATE_DISABLE"
#string STR_IIO1_PKGC_CLOCK_GATE_DISABLE_S4               #language en-US "IIO1_PKGC_CLK_GATE_DISABLE"
#string STR_IIO1_PKGC_CLOCK_GATE_DISABLE_S5               #language en-US "IIO1_PKGC_CLK_GATE_DISABLE"
#string STR_IIO1_PKGC_CLOCK_GATE_DISABLE_S6               #language en-US "IIO1_PKGC_CLK_GATE_DISABLE"
#string STR_IIO1_PKGC_CLOCK_GATE_DISABLE_S7               #language en-US "IIO1_PKGC_CLK_GATE_DISABLE"
#string STR_IIO2_PKGC_CLOCK_GATE_DISABLE               #language en-US "IIO2_PKGC_CLK_GATE_DISABLE"
#string STR_IIO2_PKGC_CLOCK_GATE_DISABLE_S0               #language en-US "IIO2_PKGC_CLK_GATE_DISABLE"
#string STR_IIO2_PKGC_CLOCK_GATE_DISABLE_S1               #language en-US "IIO2_PKGC_CLK_GATE_DISABLE"
#string STR_IIO2_PKGC_CLOCK_GATE_DISABLE_S2               #language en-US "IIO2_PKGC_CLK_GATE_DISABLE"
#string STR_IIO2_PKGC_CLOCK_GATE_DISABLE_S3               #language en-US "IIO2_PKGC_CLK_GATE_DISABLE"
#string STR_IIO2_PKGC_CLOCK_GATE_DISABLE_S4               #language en-US "IIO2_PKGC_CLK_GATE_DISABLE"
#string STR_IIO2_PKGC_CLOCK_GATE_DISABLE_S5               #language en-US "IIO2_PKGC_CLK_GATE_DISABLE"
#string STR_IIO2_PKGC_CLOCK_GATE_DISABLE_S6               #language en-US "IIO2_PKGC_CLK_GATE_DISABLE"
#string STR_IIO2_PKGC_CLOCK_GATE_DISABLE_S7               #language en-US "IIO2_PKGC_CLK_GATE_DISABLE"
#string STR_IIO_PKGC_CLOCK_GATE_DISABLE               #language en-US "IIO_PKGC_CLK_GATE_DISABLE"
#string STR_IIO_PKGC_CLOCK_GATE_DISABLE_HELP          #language en-US "Used by BIOS to disable IIO Pkg C Clock Gate from playing any role in TurnPLL"
#string STR_QPI01_PKGC_CLOCK_GATE_DISABLE             #language en-US "UPI01_PKGC_CLK_GATE_DISABL"
#string STR_QPI01_PKGC_CLOCK_GATE_DISABLE_S0             #language en-US "UPI01_PKGC_CLK_GATE_DISABL"
#string STR_QPI01_PKGC_CLOCK_GATE_DISABLE_S1             #language en-US "UPI01_PKGC_CLK_GATE_DISABL"
#string STR_QPI01_PKGC_CLOCK_GATE_DISABLE_S2             #language en-US "UPI01_PKGC_CLK_GATE_DISABL"
#string STR_QPI01_PKGC_CLOCK_GATE_DISABLE_S3             #language en-US "UPI01_PKGC_CLK_GATE_DISABL"
#string STR_QPI01_PKGC_CLOCK_GATE_DISABLE_S4             #language en-US "UPI01_PKGC_CLK_GATE_DISABL"
#string STR_QPI01_PKGC_CLOCK_GATE_DISABLE_S5             #language en-US "UPI01_PKGC_CLK_GATE_DISABL"
#string STR_QPI01_PKGC_CLOCK_GATE_DISABLE_S6             #language en-US "UPI01_PKGC_CLK_GATE_DISABL"
#string STR_QPI01_PKGC_CLOCK_GATE_DISABLE_S7             #language en-US "UPI01_PKGC_CLK_GATE_DISABL"
#string STR_QPI01_PKGC_CLOCK_GATE_DISABLE_HELP        #language en-US "Used by BIOS to disable QPI01 Pkg C Clock Gate from playing any role in TurnPLL"
#string STR_QPI2_PKGC_CLOCK_GATE_DISABLE              #language en-US "UPI23_PKGC_CLK_GATE_DISABLE"
#string STR_QPI2_PKGC_CLOCK_GATE_DISABLE_S0              #language en-US "UPI23_PKGC_CLK_GATE_DISABLE"
#string STR_QPI2_PKGC_CLOCK_GATE_DISABLE_S1              #language en-US "UPI23_PKGC_CLK_GATE_DISABLE"
#string STR_QPI2_PKGC_CLOCK_GATE_DISABLE_S2              #language en-US "UPI23_PKGC_CLK_GATE_DISABLE"
#string STR_QPI2_PKGC_CLOCK_GATE_DISABLE_S3              #language en-US "UPI23_PKGC_CLK_GATE_DISABLE"
#string STR_QPI2_PKGC_CLOCK_GATE_DISABLE_S4              #language en-US "UPI23_PKGC_CLK_GATE_DISABLE"
#string STR_QPI2_PKGC_CLOCK_GATE_DISABLE_S5              #language en-US "UPI23_PKGC_CLK_GATE_DISABLE"
#string STR_QPI2_PKGC_CLOCK_GATE_DISABLE_S6              #language en-US "UPI23_PKGC_CLK_GATE_DISABLE"
#string STR_QPI2_PKGC_CLOCK_GATE_DISABLE_S7              #language en-US "UPI23_PKGC_CLK_GATE_DISABLE"
#string STR_QPI2_PKGC_CLOCK_GATE_DISABLE_HELP         #language en-US "Used by BIOS to disable QPI2 Pkg C Clock Gate from playing any role in TurnPLL"
#string STR_FORCE_PPLL_OFF                            #language en-US "FORCE_PPLL_OFF"
#string STR_FORCE_PPLL_OFF_HELP                       #language en-US "Used by BIOS to force PPLL Off from playing any role in TurnPLL"

#string STR_VCCSA_VCCIO_DISABLE_PROMPT          #language en-US "VccSA/VccIO Disable"
#string STR_VCCSA_VCCIO_DISABLE_HELP            #language en-US "When enabled, BIOS will trade-off idle power savings for lower PC6 exit latency"

#string STR_AVG_TIME_WINDOW                     #language en-US "Averaging Time Window"
#string STR_AVG_TIME_WINDOW_HELP                #language en-US "This is used to control the effective window of the average for C0 an P0 time"
#string STR_P0_TOTALTIME_THSHLD_LOW             #language en-US "P0 TotalTimeThreshold Low"
#string STR_P0_TOTALTIME_THSHLD_LOW_HELP        #language en-US "The HW switching mechanism DISABLES the performance setting (0) when the total P0 time is less than this threshold"
#string STR_P0_TOTALTIME_THSHLD_HIGH            #language en-US "P0 TotalTimeThreshold High"
#string STR_P0_TOTALTIME_THSHLD_HIGH_HELP       #language en-US "The HW switching mechanism ENABLES the performance setting (0) when the total P0 time is greater than this threshold"
#string STR_WORKLD_CONFIG                       #language en-US "Workload Configuration"
#string STR_WORKLD_CONFIG_HELP                  #language en-US "This allows optimization for the workload characterization. The three options for selection"

#string STR_WORKLD_CONFIG_BALANCED              #language en-US "Balanced"
#string STR_IOSENES                             #language en-US "I/O sensitive"
#string STR_UMA                                 #language en-US "UMA"
#string STR_NUMA                                #language en-US "NUMA"

#string STR_PROCHOT_LOCK                           #language en-US "PROCHOT LOCK"
#string STR_PROCHOT_LOCK_HELP                      #language en-US "Setting this bit will lock in xxPROCHOT# response configurations including ENABLE_BIDIR_PROCHOT, DIS_PROCHOT_OUT, VR_THERM_ALERT_DISABLE, and PROCHOT_LOCK."
#string STR_PROC_HOT_ENABLE                           #language en-US "PROCHOT Modes"
#string STR_PROC_HOT_ENABLE_HELP                      #language en-US "When a processor thermal sensor trips (either core), the PROCHOT# will be driven.\nIf bi-direction is enabled, external agents can drive PROCHOT# to throttle the processor."
#string STR_OUTPUT_ONLY                           #language en-US "Output-only"
#string STR_INPUT_ONLY                            #language en-US "Input-only"
#string STR_BIDIRECTIONAL                         #language en-US "Both Input and Output"
#string STR_PROC_HOT_RESPONSE                           #language en-US "PROCHOT Response"
#string STR_PROC_HOT_RESPONSE_HELP                      #language en-US "Force CPU to throttle to a lower power condition such as Pn/Pm by asserting PROCHOT#.\nMSR 0x1FC [26]\n=1: go to Pm(min freq) on PROCHOT; =0: go to Pn (max efficient freq)."
#string STR_PN_CLAMPING                           #language en-US "Pn clamping"
#string STR_PM_CLAMPING                           #language en-US "Pm clamping"
#string STR_PROC_HOT_RESPONSE_RATIO               #language en-US "PROCHOT RATIO"
#string STR_PROC_HOT_RESPONSE_RATIO_HELP          #language en-US "Controls the CPU response to an inbound platform assertion of xxPROCHOT# by capping to the programmed ratio. Default value 0 will allow ME to control this value. If ME does not set ratio, default 0 equates to Pn. A non-zero value will override ME setting. The min allowed ratio is defined by PLATFORM_INFO[MIN_OPERATING_RATIO]"
#string STR_EE_TURBO_DISABLE                      #language en-US "Energy Efficient Turbo"
#string STR_EE_TURBO_DISABLE_HELP                 #language en-US "Energy Efficient Turbo Disable, MSR 0x1FC [19]"

// End of PowerManagement.uni

// need to re-aarange power management options. not sure where these have to go

#string STR_THERMAL_MONITOR_PROMPT                    #language en-US "Thermal Monitor "
#string STR_THERMAL_MONITOR_PROMPT_HELP               #language en-US "Enable/Disable Thermal Monitor"

#string STR_OSCX_REPORT                         #language en-US "  OS ACPI Cx"
#string STR_OSCX_REPORT_HELP                    #language en-US "Report CC3/CC6 to OS ACPI C2 or ACPI C3"
#string STR_OSCX_C2                             #language en-US "ACPI C2"
#string STR_OSCX_C3                             #language en-US "ACPI C3"

#string STR_FORCE_PHYSICAL_MODE_PROMPT  #language en-US "APIC Physical Mode"
#string STR_FORCE_PHYSICAL_MODE_HELP    #language en-US "Enable/Disable the APIC physical destination mode"

#string STR_IIO_LLC_WAYS_PROMPT                 #language en-US "IIO LLC Ways [19:0](Hex)"
#string STR_IIO_LLC_WAYS_HELP                   #language en-US "MSR CBO_SLICE0_CR_IIO_LLC_WAYS bitmask"
#string STR_QLRU_CFG_HI_PROMPT                  #language en-US "QLRU Config [63:32](Hex)"
#string STR_QLRU_CFG_LO_PROMPT                  #language en-US "QLRU Config [31:0](Hex)"
#string STR_QLRU_CFG_HELP                       #language en-US "VIRTUAL_MSR_CR_QLRU_CONFIG bitmask"

#string STR_TARGETED_SMI                        #language en-US "Targeted Smi"
#string STR_TARGETED_SMI_HELP                   #language en-US "Enable or Disable Targeted Smi Feature"

//PER SOCKET SETUP OPTIONS
#string STR_PERSOCKET_CONFIG_FORM_TITLE         #language en-US "Per-Socket Configuration"
#string STR_PERSOCKET_CONFIG_FORM_HELP          #language en-US "Change Per-Socket Settings"
#string STR_SOCKET_CONFIG_FORM_TITLE_0          #language en-US "CPU Socket 0 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_1          #language en-US "CPU Socket 1 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_2          #language en-US "CPU Socket 2 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_3          #language en-US "CPU Socket 3 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_4          #language en-US "CPU Socket 4 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_5          #language en-US "CPU Socket 5 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_6          #language en-US "CPU Socket 6 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_7          #language en-US "CPU Socket 7 Configuration"

#string STR_CORE_DISABLE_BITMAP_PROMPT_0        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_1        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_2        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_3        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_4        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_5        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_6        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_7        #language en-US "Core Disable Bitmap(Hex)"
#string STR_STR_CORE_DISABLE_BITMAP_HELP        #language en-US "0: Enable all cores. 3fff: Disable all cores"

#string STR_IOT_EN_BITMAP_HELP                  #language en-US "Each bit enables IOT/OCLA for a CBo."

#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_0           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_1           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_2           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_3           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_4           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_5           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_6           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_7           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_HELP               #language en-US "Valid from 0 to 16 IDs"

#string STR_CPU_PM_PROMPT               #language en-US "Power Technology"
#string STR_CPU_PM_PROMPT_HELP          #language en-US "Switch CPU Power Management profile"
#string STR_CPU_PM_DISABLED             #language en-US "Disable"
#string STR_CPU_PM_ENABLED              #language en-US "Energy Efficient"
#string STR_CPU_PM_CUSTOM               #language en-US "Custom"

#string STR_PACKAGE_C_STATE_CONTROL_FORM_TITLE    #language en-US "Package C State Control"
#string STR_PACKAGE_C_STATE_CONTROL_FORM_HELP     #language en-US "Package C State setting"
#string STR_CPU_C_STATE_CONTROL_FORM_TITLE        #language en-US "CPU C State Control"
#string STR_CPU_C_STATE_CONTROL_FORM_HELP         #language en-US "CPU C State setting"
#string STR_P_STATE_DOMAIN_REPOR                  #language en-US "Number of P states"
#string STR_NUMBER_OF_CUSTOM_P_STATES_HELP        #language en-US "Sets the number of custom P-states. At least 2 states must be present."
#string STR_P_STATE_CONTROL_FORM_TITLE            #language en-US "CPU P State Control"
#string STR_P_STATE_CONTROL_FORM_HELP             #language en-US "P State Control Configuration Sub Menu, include Turbo, XE and etc."
#string STR_P_STATE_DOMAIN_REPORT                 #language en-US "P State Domain"
#string STR_P_STATE_DOMAIN_REPORT_HELP            #language en-US "Per Logical (ONE): indicates the P-state domain for each logical proc in the system. Per Package (ALL): all procs indicate the same domain in the same package."
#string STR_ALL                                   #language en-US "ALL"
#string STR_ONE                                   #language en-US "ONE"
#string STR_PROCESSOR_PSD_FUNC                    #language en-US "EIST PSD Function"
#string STR_PROCESSOR_PSD_FUNC_HELP               #language en-US "Choose HW_ALL/SW_ALL/SW_ANY in _PSD return"
#string STR_HW_ALL                                #language en-US "HW_ALL"
#string STR_SW_ALL                                #language en-US "SW_ALL"
#string STR_SW_ANY                                #language en-US "SW_ANY"
#string STR_PROCESSOR_SPD_FUNC                    #language en-US "Single Power Domain (SPD)"
#string STR_PROCESSOR_SPD_FUNC_HELP               #language en-US "Single Power Domain aggregates the request from all cores and the highest request ratio is applied to all cores on the processor"
#string STR_PROCESSOR_SINGLE_PCTL                 #language en-US "SINGLE_PCTL"
#string STR_PROCESSOR_SINGLE_PCTL_HELP            #language en-US "Single PCTL Mode makes all cores in the processor go to the most recent ratio request"
#string STR_NO                                    #language en-US "No"
#string STR_YES                                   #language en-US "Yes"
#string STR_PL2_SAFETY_NET_ENABLE                 #language en-US "PL2_SAFETY_NET_ENABLE"
#string STR_PL2_SAFETY_NET_ENABLE_HELP            #language en-US "PCU_MISC_CONFIG Bit[1]: PL2_SAFETY_NET_ENABLE"

#string STR_BOOT_P_STATE                          #language en-US "Boot performance mode"
#string STR_BOOT_P_STATE_HELP                     #language en-US "Select the performance state that the BIOS will set before OS hand off."
#string STR_BOOT_P_STATE_MAX                      #language en-US "Max Performance"
#string STR_BOOT_P_STATE_MIN                      #language en-US "Max Efficient"
#string STR_BOOT_P_STATE_SPS_NM                   #language en-US "Set by Intel Node Manager"

#string STR_HWPM_STATE_CONTROL_FORM_TITLE        #language en-US "Hardware PM State Control"
#string STR_HWPM_STATE_CONTROL_FORM_HELP         #language en-US "Hardware P-State setting"
#string STR_PROCESSOR_HWPM_ENABLE                 #language en-US "Hardware P-States"
#string STR_PROCESSOR_HWPM_ENABLE_HELP             #language en-US "Disable: Hardware chooses a P-state based on OS Request (Legacy P-States)\nNative Mode:Hardware chooses a P-state based on OS guidance\nOut of Band Mode:Hardware autonomously chooses a P-state (no OS guidance)"
#string STR_NATIVE_MODE                            #language en-US "Native Mode"
#string STR_HWPM_OOB                             #language en-US "Out of Band Mode"
#string STR_HWPM_NO_NATIVE                       #language en-US "Native Mode with No Legacy Support"
#string STR_PROCESSOR_HWPM_INTERRUPT_ENABLE      #language en-US "HardwarePM Interrupt"
#string STR_PROCESSOR_HWPM_INTERRUPT_ENABLE_HELP #language en-US "Enable/Disable Hardware PM Interrupt"

#string STR_PROCESSOR_EPP_PROFILE                   #language en-US  "EPP profile"
#string STR_PROCESSOR_EPP_PROFILE_HELP              #language en-US  "Choose an HWPM Profile (EPP)"

#string STR_CPU_T_STATE_CONTROL_FORM_TITLE        #language en-US "CPU T State Control"
#string STR_CPU_T_STATE_CONTROL_FORM_HELP         #language en-US "CPU T State setting"

#string STR_CPU_T_STATE_CONTROL_FORM_TITLE        #language en-US "CPU T State Control"
#string STR_CPU_T_STATE_CONTROL_FORM_HELP         #language en-US "CPU T State setting"

#string STR_CPU_THERMAL_MANAGE_FORM_TITLE         #language en-US "CPU Thermal Management"
#string STR_CPU_THERMAL_MANAGE_FORM_HELP          #language en-US "CPU Thermal Related setting"

#string STR_CPU_POWER_ADVANCED_CONFIG_TITLE       #language en-US "CPU - Advanced PM Tuning"
#string STR_CPU_POWER_ADVANCED_CONFIG_HELP        #language en-US "Setting Energy Per Bias, Pwr_Ctl, PP0 Current SWLTD, SAPM etc"

#string STR_SOCKET_RAPL_FORM                      #language en-US "SOCKET RAPL Config"
#string STR_SOCKET_RAPL_FORM_HELP                 #language en-US "SOCKET RAPL Configuration Sub Menu - TURBO_POWER_LIMIT CSR & MSR"

#string STR_MSR_PP_CURT_PSI_CONFIG_FORM           #language en-US "PSI CONFIG"
#string STR_MSR_PP_CURT_PSI_CONFIG_FORM_HELP      #language en-US "Program PRI_PLANE_CURT_CFG_CTRL_MSR 0x601 Sub Menu, PSI Configuration"

#string STR_ENTRY_CRITERIA_FORM                   #language en-US "Program Pkg C-state Entry Criteria"
#string STR_ENTRY_CRITERIA_FORM_HELP              #language en-US "Program CSR_ENTRY_CRITERIA 1:10:2:0x7C Sub Menu"

#string STR_PROG_CSR_SWLTROVRD_FORM               #language en-US "Latency Tolerence Requirement (LTR)"
#string STR_PROG_CSR_SWLTROVRD_FORM_HELP          #language en-US "Program CSR_SWLTROVRD 1:10:1:0x78 Sub Menu"

#string STR_ENERGY_PERF_BIAS_FORM                 #language en-US "Energy Perf BIAS"
#string STR_ENERGY_PERF_BIAS_FORM_HELP            #language en-US "Energy Perf BIAS Sub Menu"

#string STR_MSR_PP_CURT_CFG_CTRL_FORM             #language en-US "Package Current Config"
#string STR_MSR_PP_CURT_CFG_CTRL_FORM_HELP        #language en-US "Program PRI_PLANE_CURT_CFG_CTRL_MSR 0x601 Sub Menu"

#string STR_CSR_DYNAMIC_PERF_POWER_CTL_FORM       #language en-US "EPB Override Control"
#string STR_CSR_DYNAMIC_PERF_POWER_CTL_FORM_HELP  #language en-US "Program CSR_DYNAMIC_PERF_POWER_CTL 1:10:2:0x64 Sub Menu"

#string STR_PROG_CSR_SAPMCTL_FORM                 #language en-US "Pkg C-state SA Power Management Control"
#string STR_PROG_CSR_SAPMCTL_FORM_HELP            #language en-US "Program CSR_SAPMCTL 1:30:1:0xb0 Sub Menu"

#string STR_CSR_PERF_P_LIMIT_FORM                 #language en-US "Perf P-Limit"
#string STR_CSR_PERF_P_LIMIT_FORM_HELP            #language en-US "Program PERF_P_LIMIT 1:30:2:0xe4 Sub Menu"
#string STR_PERFPLIMITEN                        #language en-US "Perf P Limit"
#string STR_PERFPLIMITEN_HELP                   #language en-US "Enable/Disable Performance P-Limit"
#string STR_PERF_P_LIMIT_THRESHOLD              #language en-US "Perf P-Limit Threshold"
#string STR_PERF_P_LIMIT_THRESHOLD_HELP         #language en-US "Uncore frequency threshold above which this socket will trigger the feature and start trying to raise frequency of other sockets."
#string STR_PERF_P_LIMIT_CLIP                   #language en-US "Perf P-Limit Clip"
#string STR_PERF_P_LIMIT_CLIP_HELP              #language en-US "Maximum value the floor is allowed to be set to for perf P-limit."

#string STR_PERF_PLIMIT_DIFFERENTIAL                   #language en-US "Perf P-Limit Differential"
#string STR_PERF_PLIMIT_DIFFERENTIAL_HELP              #language en-US "Parameter used to tune how far below local socket frequency remote socket frequency is allowed to be. Also impacts rate at which frequency drops when feature disengages. "

#string STR_C2C3TT                                #language en-US "C2C3TT"
#string STR_C2C3TT_HELP                           #language en-US "Default = 0, means [AUTO].   C2 to C3 Transition Timer, PPDN_INIT = 1:10:1:74 Bit[11:0]."

#string STR_CONFIG_TDP_ENABLE                 #language en-US "Config TDP"
#string STR_CONFIG_TDP_ENABLE_HELP            #language en-US "Config TDP level selection"
#string STR_NOMINAL                           #language en-US "Nominal"
#string LEVEL_1                               #language en-US "Level 1"
#string LEVEL_2                               #language en-US "Level 2"

#string STR_HLV_SASV_FORM_TITLE                   #language en-US "PKGc Interrupt Response Time"
#string STR_HLV_SASV_CONTROL_FORM_HELP            #language en-US "Programmable Package C-state interrupt response time setup control"
#string STR_C_STATE_LATENCY_CTRL_0                #language en-US "C_STATE_LATENCY_CONTROL_0"
#string STR_C_STATE_LATENCY_CTRL_1                #language en-US "C_STATE_LATENCY_CONTROL_1"
#string STR_C_STATE_LATENCY_CTRL_2                #language en-US "C_STATE_LATENCY_CONTROL_2"

#string STR_LATENCY_CTRL_VALID_PROMPT             #language en-US "  VALID:"
#string STR_LATENCY_CTRL_VALID_HELP               #language en-US "This field qualifies the validity of the Value field in this register."
#string STR_LATENCY_CTRL_VALID1_PROMPT             #language en-US "  VALID:"
#string STR_LATENCY_CTRL_VALID1_HELP               #language en-US "This field qualifies the validity of the Value field in this register."
#string STR_LATENCY_CTRL_VALID2_PROMPT             #language en-US "  VALID:"
#string STR_LATENCY_CTRL_VALID2_HELP               #language en-US "This field qualifies the validity of the Value field in this register."

#string STR_LATENCY_CTRL_MULTIPLIER_PROMPT        #language en-US "  MULTIPLIER:"
#string STR_LATENCY_CTRL_MULTIPLIER_HELP          #language en-US "This field indicates the unit of measurement that is defined for the Value field in this register."
#string STR_LATENCY_CTRL_MULTIPLIER1_PROMPT        #language en-US "  MULTIPLIER:"
#string STR_LATENCY_CTRL_MULTIPLIER1_HELP          #language en-US "This field indicates the unit of measurement that is defined for the Value field in this register."
#string STR_LATENCY_CTRL_MULTIPLIER2_PROMPT        #language en-US "  MULTIPLIER:"
#string STR_LATENCY_CTRL_MULTIPLIER2_HELP          #language en-US "This field indicates the unit of measurement that is defined for the Value field in this register."

#string STR_LATENCY_CTRL_VALUE_PROMPT             #language en-US "  VALUE:"
#string STR_LATENCY_CTRL_VALUE_HELP               #language en-US "The Interrupt Response Time Limit is given in units defined in the Multiplier field of this register."
#string STR_LATENCY_CTRL_VALUE1_PROMPT             #language en-US "  VALUE:"
#string STR_LATENCY_CTRL_VALUE1_HELP               #language en-US "The Interrupt Response Time Limit is given in units defined in the Multiplier field of this register."
#string STR_LATENCY_CTRL_VALUE2_PROMPT             #language en-US "  VALUE:"
#string STR_LATENCY_CTRL_VALUE2_HELP               #language en-US "The Interrupt Response Time Limit is given in units defined in the Multiplier field of this register."

#string ACPI_S_STATE_CONTROLORM_TITLE              #language en-US "ACPI Sx State Control"
#string ACPI_S_STATE_CONTROLORM_HELP               #language en-US "ACPI Sx State Control individually"
#string STR_ACPI_S3_STATE_REPORT                   #language en-US "ACPI S3"
#string STR_ACPI_S3_STATE_REPORT_HELP              #language en-US "Control ACPI S3 State"
#string STR_ACPI_S4_STATE_REPORT                   #language en-US "ACPI S4"
#string STR_ACPI_S4_STATE_REPORT_HELP              #language en-US "Control ACPI S4 State"

#string STR_TCC_ACTIVATION_OFFSET_PROMPT           #language en-US "TCC Activation Offset "
#string STR_TCC_ACTIVATION_OFFSET_PROMPT_HELP      #language en-US "Offset from factory set TCC activation temperature at which the Thermal Control Circuit must be activated."

#string STR_UFS_DISABLE_PROMPT           #language en-US "Uncore Freq Scaling (UFS)"
#string STR_UFS_DISABLE_HELP             #language en-US "Enable/Disable autonomous uncore frequency scaling"

#string STR_MANUAL                      #language en-US  "Manual"
#string STR_SKIP                        #language en-US  "SKIP"

#string STR_PROCESSOR_EIST              #language en-US "SpeedStep (Pstates)"
#string STR_PROCESSOR_EIST_HELP         #language en-US "Enable/Disable EIST (P-States)"

#string STR_MEMORY_PM_CONFIG_FORM_TITLE    #language en-US "Memory Power & Thermal Configuration"
#string STR_MEMORY_PM_CONFIG_FORM_HELP     #language en-US "Displays and provides option to change the Memory Settings"

#string STR_DRAM_RAPL_FORM                      #language en-US "DRAM RAPL Configuration"
#string STR_DRAM_RAPL_FORM_HELP                 #language en-US "DRAM RAPL Control Sub Menu"

#string STR_PROCESSOR_C1E               #language en-US "Enhanced Halt State (C1E)"
#string STR_PROCESSOR_C1E_HELP          #language en-US "Core C1E auto promotion Control. Takes effect after reboot."

#string STR_C6_ENABLE                   #language en-US "CPU C6 report"
#string STR_C6_ENABLE_HELP              #language en-US "Enable/Disable CPU C6(ACPI C3) report to OS"

#string STR_DRAM_RAPL_FORM              #language en-US "DRAM RAPL Configuration"
#string STR_DRAM_RAPL_FORM_HELP         #language en-US "DRAM RAPL Control Sub Menu"
#string STR_OVRDDRAMRAPLBWLIMITTF       #language en-US "Override BW_LIMIT_TF"
#string STR_OVRDDRAMRAPLBWLIMITTF_HELP  #language en-US "Allows custom tuning of BW_LIMIT_TF when DRAM RAPL is enabled"
#string STR_FAST_RAPL_DUTY_CYCLE        #language en-US "FAST_RAPL_NSTRIKE_PL2_DUTY_CYCLE"
#string STR_FAST_RAPL_DUTY_CYCLE_HELP   #language en-US "FAST_RAPL_NSTRIKE_PL2_DUTY_CYCLE value between 25 (10%) - 64 (25%)"

#string STR_DRAM_RAPL_EXTENDED_RANGE_PROMPT #language en-US "DRAM RAPL Extended Range"
#string STR_DRAM_RAPL_EXTENDED_RANGE_HELP   #language en-US "Select DRAM RAPL Extended Range"

#string STR_CMS_DRAM_PM_ENABLE_PROMPT  #language en-US "CMS ENABLE DRAM PM"
#string STR_CMS_DRAM_PM_ENABLE_HELP  #language en-US "CMS ENABLE DRAM PM"

#string STR_ACPI_TSTATES_ENABLE         #language en-US "Software Controlled T-States"
#string STR_ACPI_TSTATES_ENABLE_HELP    #language en-US "Enable/Disable Software Controlled T-States"

#string STR_TT_DUTY_CYCLE               #language en-US "T-State Throttle Level"
#string STR_TT_DUTY_CYCLE_HELP          #language en-US "On-Die Thermal Throttling"
#string STR_TT_DUTY_CYCLE_1             #language en-US "6.25%"
#string STR_TT_DUTY_CYCLE_2             #language en-US "12.5%"
#string STR_TT_DUTY_CYCLE_3             #language en-US "18.75%"
#string STR_TT_DUTY_CYCLE_4             #language en-US "25.0%"
#string STR_TT_DUTY_CYCLE_5             #language en-US "31.25%"
#string STR_TT_DUTY_CYCLE_6             #language en-US "37.5%"
#string STR_TT_DUTY_CYCLE_7             #language en-US "43.75%"
#string STR_TT_DUTY_CYCLE_8             #language en-US "50.0%"
#string STR_TT_DUTY_CYCLE_9             #language en-US "56.25%"
#string STR_TT_DUTY_CYCLE_10            #language en-US "62.5%"
#string STR_TT_DUTY_CYCLE_11            #language en-US "68.75%"
#string STR_TT_DUTY_CYCLE_12            #language en-US "75.0%"
#string STR_TT_DUTY_CYCLE_13            #language en-US "81.25%"
#string STR_TT_DUTY_CYCLE_14            #language en-US "87.5%"
#string STR_TT_DUTY_CYCLE_15            #language en-US "93.75%"


#string STR_PROCESSOR_CCX               #language en-US "Core C State"
#string STR_PROCESSOR_CCX_HELP          #language en-US "Core C-state Control. Takes effect after reboot."

#string STR_PACKAGE_CSTATE_REPORT       #language en-US "Package C State"
#string STR_PACKAGE_CSTATE_REPORT_HELP  #language en-US "Package C State limit"

#string STR_C0SUPPORT                   #language en-US "C0/C1 state"
#string STR_C2SUPPORT                   #language en-US "C2 state"
#string STR_C6SUPPORT                   #language en-US "C6(non Retention) state"
#string STR_C6_RETSUPPORT               #language en-US "C6(Retention) state"

#string STR_PROCESSOR_AUTO_CSTATE_ENABLE          #language en-US "Autonomous Core C-State"
#string STR_PROCESSOR_AUTO_CSTATE_ENABLE_HELP     #language en-US "Autonomous Core C-State Control"

#string STR_PROCESSOR_EPP_ENABLE          #language en-US "EPP Enable"
#string STR_PROCESSOR_EPP_ENABLE_HELP     #language en-US "When disabled, HW masks EPP in CPUID[6].10 and uses EPB for EPP"

#string STR_PROCESSOR_APS_ROCKETING       #language en-US "APS rocketing"
#string STR_PROCESSOR_APS_ROCKETING_HELP  #language en-US "Enable/Disable the rocketing mechanism in the HWP p-state selection pcode algorithm. Rocketing enables the core ratio to jump to max turbo instantaneously as opposed to a smooth ramp up"

#string STR_PROCESSOR_SCALABILITY         #language en-US "Scalability"
#string STR_PROCESSOR_SCALABILITY_HELP    #language en-US "Enable/Disable the use of scalability in HWP pcode power efficiency algorithms. Scalability is the measure of estimated performance improvement for a given increase in core frequency"

#string STR_PROCESSOR_PPO_BUDGET          #language en-US "PPO-Budget"
#string STR_PROCESSOR_PPO_BUDGET_HELP     #language en-US "Enable/disable core parameter based per core power budgeting. PPO-Budget allocates power budget to cores based on their scalability/EPP"

#string STR_PROCESSOR_PECI_PCS_EPB          #language en-US "PECI PCS EPB"
#string STR_PROCESSOR_PECI_PCS_EPB_HELP     #language en-US "Controls whether PECI has control over EPB"
#string STR_PROCESSOR_EPB_OS_CTRL           #language en-US "OS controls EPB"
#string STR_PROCESSOR_EPB_PECI_CTRL         #language en-US "PECI controls EPB using PCS"


#string STR_NOLIMIT                     #language en-US "No Limit"

#string STR_TURBO_RATIO_LIMIT_RATIO_0               #language en-US "TurboRatioLimit0"
#string STR_TURBO_RATIO_LIMIT_RATIO_HELP            #language en-US "User defined Ratio for TurboRatioLimits Msr(0x1AD)"
#string STR_TURBO_RATIO_LIMIT_CORES_0               #language en-US "TurboRatioCores0"
#string STR_TURBO_RATIO_LIMIT_CORES_HELP            #language en-US "User defined core# for TurboRatioLimits Msr(0x1AE)"
#string STR_TURBO_RATIO_LIMIT_RATIO_1               #language en-US "TurboRatioLimit1"
#string STR_TURBO_RATIO_LIMIT_CORES_1               #language en-US "TurboRatioCores1"
#string STR_TURBO_RATIO_LIMIT_RATIO_2               #language en-US "TurboRatioLimit2"
#string STR_TURBO_RATIO_LIMIT_CORES_2               #language en-US "TurboRatioCores2"
#string STR_TURBO_RATIO_LIMIT_RATIO_3               #language en-US "TurboRatioLimit3"
#string STR_TURBO_RATIO_LIMIT_CORES_3               #language en-US "TurboRatioCores3"
#string STR_TURBO_RATIO_LIMIT_RATIO_4               #language en-US "TurboRatioLimit4"
#string STR_TURBO_RATIO_LIMIT_CORES_4               #language en-US "TurboRatioCores4"
#string STR_TURBO_RATIO_LIMIT_RATIO_5               #language en-US "TurboRatioLimit5"
#string STR_TURBO_RATIO_LIMIT_CORES_5               #language en-US "TurboRatioCores5"
#string STR_TURBO_RATIO_LIMIT_RATIO_6               #language en-US "TurboRatioLimit6"
#string STR_TURBO_RATIO_LIMIT_CORES_6               #language en-US "TurboRatioCores6"
#string STR_TURBO_RATIO_LIMIT_RATIO_7               #language en-US "TurboRatioLimit7"
#string STR_TURBO_RATIO_LIMIT_CORES_7               #language en-US "TurboRatioCores7"

//CSR_PMAX_CONFIG
#string STR_CSR_PMAX_CONFIG_FORM                    #language en-US "PMAX CONFIG Configuration"
#string STR_CSR_PMAX_CONFIG_FORM_HELP               #language en-US "PMAX CONFIG Control Sub Menu"
// Commenting out PMAX Offset Table Setup question - Causes issue with GBT XML Tool, Customer may re-enable as needed
//#string STR_PMAX_OFFSET_TABLE                       #language en-US "Use PMAX Offset Table"
//#string STR_PMAX_OFFSET_TABLE_HELP                  #language en-US "PMAX offset adjustment table is intended for use with 0.9mohm loadline platforms. Disable this option with 1.0mohm loadlines."
#string STR_PMAX_SIGN                               #language en-US "PMAX Config Sign"
#string STR_PMAX_SIGN_HELP                          #language en-US "Controls whether PMAX Config offset is a positive or negative value."
#string STR_POSITIVE                                #language en-US "Positive"
#string STR_NEGATIVE                                #language en-US "Negative"
#string STR_PMAX_CONFIG                             #language en-US "PMAX Config Offset"
#string STR_PMAX_CONFIG_HELP                        #language en-US "Input decimal correction factor to program. Valid input values are 0 to 15.  Will be positive or negative based on PMAX Config Sign value."

#string STR_WFR_SOCKET_WA                           #language en-US  "WFR Uncore GV Rate Reduction"
#string STR_WFR_SOCKET_WA_HELP                      #language en-US  "AUTO: Enable if WFR socket is detected in system.\nEnabled: Always enables WFR Uncore GV Rate Reduction."

#string STR_USE_SPT_WORKAROUND                           #language en-US  "use SPT workarounds"
#string STR_USE_SPT_WORKAROUND_HELP                      #language en-US  "Enabled: use SPT workarounds - B2P cmd MISC_WORKAROUND_ENABLE"


#string STR_ENERGY_PERF_MODE_CPU2006                #language en-US "Extreme Performance"	// CPU 2006
#string STR_ENERGY_PERF_MODE_SPECPOWER                #language en-US "Max Power Efficient"	// SPEC POWER


//
// End of file
//
